app/channels/chatrooms_channel.rb

  def subscribed
    stop_all_streams
    chatroom = Chatroom.find(params[:room])
---
SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]