app/controllers/chatrooms_controller.rb

  def index
    current_user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def show
    chatroom = Chatroom.find(params[:id])
---
SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]