app/controllers/messages_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def create
        message = Message.new(message_params)
        room = Room.find(message_params["room_id"])

SELECT "messages".* FROM "messages" WHERE (7) LIMIT $1  [["LIMIT", 1]]
---
    def destroy
      Message.find(params[:id]).destroy