app/controllers/messages_controller.rb

  def index
    messages = Message.all
---
SELECT "messages".* FROM "messages"

  def create
    message = Message.create(messages_params)
---
INSERT INTO "messages" ("user_id", "chatroom_id", "message_body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["chatroom_id", 1], ["message_body", "Will"], ["created_at", "2022-07-26 14:09:08.231885"], ["updated_at", "2022-07-26 14:09:08.231885"]]

  def update
    message = Message.find(params[:id])
    message.update(messages_params)
    chatroom = Chatroom.find(messages_params[:chatroom_id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "messages" SET "message_body" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["message_body", "hey world how are you ?"], ["updated_at", "2022-07-26 15:01:47.511988"], ["id", 14]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    message = Message.find_by(id: params[:id])
    if message.delete
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 14]]