app/controllers/messages_controller.rb

  def show
    render json: Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]