app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms"
---
  def index
    rooms = Room.all

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    room = Room.find(params[:id])

INSERT INTO "rooms" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "movie fanatics"], ["description", "this rooms talk all about movies "], ["created_at", "2022-07-22 21:31:45.641525"], ["updated_at", "2022-07-22 21:31:45.641525"]]
---
  def create
    room = Room.create!(rooms_params)

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def destroy
    Room.find(params[:id]).destroy