app/controllers/user_rooms_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def create
        user = User.find_by(username: params[:username])
        user_rooms = UserRoom.create(user_id: user.id,room_id: params[:room_id])
        room = Room.find(params[:room_id])