app/controllers/users_controller.rb

  def create
    user = User.create!(user_params)
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    user = User.find(params[:id])
    user.update(active: params[:active]);
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "sinclaired"], ["updated_at", "2022-07-24 17:55:17.814668"], ["id", 18]]