app/controllers/user_rooms_controller.rb

    def index
        user_rooms = UserRoom.all
---
SELECT "user_rooms".* FROM "user_rooms"

    def show
        user_room = UserRoom.find(params[:id])
---
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def create
        # user = User.find_by(username: params[:username])
        user_rooms = UserRoom.create!(user_rooms_params)
---
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 12], ["room_id", 12], ["created_at", "2022-07-24 17:43:47.829412"], ["updated_at", "2022-07-24 17:43:47.829412"]]