app/controllers/users_controller.rb

INSERT INTO "rooms" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "osvaldo"], ["description", "This is the beginning of your new room"], ["created_at", "2022-07-22 15:17:00.169176"], ["updated_at", "2022-07-22 15:17:00.169176"]]
INSERT INTO "rooms" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "matt123"], ["description", "This is the beginning of your new room"], ["created_at", "2022-07-24 15:50:48.070775"], ["updated_at", "2022-07-24 15:50:48.070775"]]
---
  def create
    user = User.create!(user_params)
    if user
      room = Room.creaye(name: user.username, description: "This is the beginning of your new room")
      user_rooms = UserRooms.create(user_id: user.id, room_id: room.id)
      message = Message.create(body: "THis is the beginning of your new message", room_id: room.id, user_id: user.id)